uniform mat4 u_MVPMatrix;	// Хосолсон загвар/харагдах/проекцийн матрицыг төлөөлөх тогтмол
uniform mat4 u_MVMatrix; 	// Хосолсон загвар/харалтын матрицыг төлөөлөх тогтмол
uniform mat3 u_LightPos;	// Нүдний орон зай дахь гэрлийн байрлал

attribute vec4 a_Position; 	// Орой бүрийн байрлалын мэдээллийг бид оруулах болно
attribute vec4 a_Color;  	// Орой бүрийн өнгөний мэдээллийг бид оруулах болно
attribute vec3 a_Normal;	// Орой бүрийн хэвийн мэдээллийг бид дамжуулах болно
attribute vec2 a_TexCoordinate;   // Орой бүрийн бүтцийн координатын мэдээллийг бид дамжуулах болно.

varying vec3 v_Position;  	// Үүнийг фрагмент шэйдер рүү шилжүүлэх болно.
varying vec4 v_Color;    	// Үүнийг фрагмент шэйдер рүү шилжүүлэх болно.
varying vec3 v_Normal;    	// Үүнийг фрагмент шэйдер рүү шилжүүлэх болно.
varying vec2 v_TexCoordinate;   // Үүнийг фрагмент шэйдер рүү шилжүүлэх болно.

// Манай оройн шэйдерийн нэвтрэх цэг
void main() {
    // Оройг нүдний зай болгон хувиргана.
    v_Position = vec3(u_MVMatrix * a_Position);
    // Өнгөөр дамжин өнгөрнө.
    v_Color = a_Color;
    // Хэвийн чиг баримжааг нүдний зай болгон хувиргана.
    v_Normal = vec3(u_MVMatrix * vec4(a_Normal, 0.0));
    // gl_Position нь эцсийн байрлалыг хадгалахад хэрэглэгддэг тусгай хувьсагч юм.
    // Дэлгэцийн хэвийн координатын эцсийн цэгийг авахын тулд оройг матрицаар үржүүлнэ.
    gl_Position = u_MVPMatrix * a_Position;
    // Бүтцийн координатаар дамжина.
    v_TexCoordinate = a_TexCoordinate;
}
